from pyrogram import Client, filters
from pyrogram.types import Message

BOT_TOKEN = "8433474851:AAGFt_WZ2agAWcM-UVmLxzhSrH-aySkIcaw"
API_ID = 25742938
API_HASH = "b35b715fe8dc0a58e8048988286fc5b6"


app = Client(
    "name",
    bot_token=BOT_TOKEN,
    api_id=API_ID,
    api_hash=API_HASH
)

FONT_MAP = {
    
    "a":"ᴧ","b":"ʙ","c":"ᴄ","d":"ᴅ","e":"є","f":"ғ","g":"ɢ","h":"ʜ","i":"ɪ",
    "j":"ᴊ","k":"ᴋ","l":"ʟ","m":"ϻ","n":"η","o":"σ","p":"ᴘ","q":"ǫ","r":"ꝛ",
    "s":"s","t":"ᴛ","u":"υ","v":"ᴠ","w":"ᴡ","x":"x","y":"ʏ","z":"ᴢ",

    
    "A":"𝐀‌","B":"𝐁‌","C":"𝐂‌","D":"𝐃‌","E":"𝐄‌","F":"𝐅‌","G":"𝐆‌",
    "H":"𝐇‌","I":"𝐈‌","J":"𝐉‌","K":"𝐊‌","L":"𝐋‌","M":"𝐌‌","N":"𝐍‌",
    "O":"𝐎‌","P":"𝐏‌","Q":"𝐐‌","R":"𝐑‌","S":"𝐒‌","T":"𝐓‌","U":"𝐔‌",
    "V":"𝐕‌","W":"𝐖‌","X":"𝐗‌","Y":"𝐘‌","Z":"𝐙‌",
}

def convert(text: str) -> str:
    return "".join(FONT_MAP.get(ch, ch) for ch in text)



STYLES = [
    ("𓂃❛ ⟶", "❜ 🌙⤹🌸"),
    ("❍⏤●", "●───♫▷"),
    ("🤍 ⍣⃪ ᶦ ᵃᵐ⛦⃕", "❛𝆺𝅥⤹࿗𓆪ꪾ™"),
    ("𓆰𝅃🔥", "⃪⍣꯭꯭𓆪꯭🝐"),
    ("◄❥❥⃝⃪⃕🦚⟵᷽᷍", "˚◡⃝🐬᪳𔘓❁❍•:➛"),
    ("➺꯭꯭꯭𝅥𝆬🦋⃪꯭─⃛┼", "🥵⃝⃝ᬽ⃪꯭꯭➺꯭⎯⎯᪵᪳"),
    ("◄⏤🝛꯭𝐈𝛕ᷟ𝚣⃪ꙴ🥀⃝⃪", "⃝☠⎯꯭𓆩♡꧂"),
    ("🦋⃟≛⃝⋆⋆≛⃞", "𝄟🦋⃟≛⃝≛"),
    ("𐏓𓆩❤🔥𓆪𝆺꯭𝅥༎ࠫ⛧", "ࠫ༎𝆺𝅥𓆩⍣꯭⃟🍷༎᪵⛧"),
    ("𓄂𝆺𝅥⃝🥀⃪⃪꯭ᷟ⃜𖥫꯭꯭꯭𝆺꯭꯭𝅥", "𝆺꯭𝅥🎭🌹꯭"),
    ("𓄂─⃛𓆩🫧𝆺𝅥⃝𐏓", "㋛𓆪꯭⵿٭🍃"),
    ("◄⏤⃪⃝⃪𐏓🝛꯭", "⸙ꠋꠋꠋꠋꠋ⛦⃪⃪🝛꯭••➤"),
    ("🎡𓆩᪵🌸⃝۫𝞄⃕𝖋𝖋꯭ᜊ𝆺𝅥⃝", "┼⃖ꭗ🦋¦🌺--🎋"),
    ("⛦⃕𝄟•๋๋๋๋๋๋๋๋๋๋๋๋๋๋🦋⃟⃟⃟≛⃝💖", "🦋•๋๋๋๋๋๋๋๋๋๋๋๋๋๋𝄟"),
    ("••ᯓ❥๋๋๋๋๋๋๋๋๋๋๋๋ꗝ༎꯭ࠫ🤍𝆺꯭𝅥", "𝆺꯭𝅥༎ࠫ◡⃝𑲭"),
    ("𝐈𝛕ᷟ𝚣⃪ꙴ⋆†།┼⃖•🔥⃞⃪⃜", "🔥⃞⃪⃜𓆪🦋✿"),
    ("❍─⃜𓆩〭⃛〬🤍𓆪˹", ".⍣⃪ꭗ𝆺𝅥𔘓🪽"),
    ("𝆺𝅥اـ꯭ـ꯭𝞂⃕𝝲𝝴꯭•⚚•𝆺꯭𝅥", "𝆺꯭𝅥ꀭ‧₊𝁾⟶🍃˚"),
    ("◄⏤🔥⃝⃪🐼𓆩꯭❛", "❜꯭𓆪⎯⟶"),
    ("❍─⃜𓆩〭⃛〬👒𓆪⃪꯭", "🤍᪳𝆺꯭𝅥⎯⎯"),
    ("◄⏤❥≛⃝", "🍁⃝➤🕊⃝🝐"),
    ("°ꗝؖ༎꯭ࠫᜊ𝆺꯭𝅥🔥⃝❥༎ࠫ𝆺꯭𝅥", "༎ࠫ٭⃪꯭꯭⃜꯬👅"),
    ("◄⏤🫧⃝⃪🦋꯭", "◡⃝ا۬🌸᪳𝆺꯭𝅥⎯꯭"),
    ("◄ᯓ❥≛⃝🌸꯭", "💗⃝꯭꯭❥꯭꯭✿꯭꯭࿐"),
    ("❝ .𝁘ໍ ", "🍷𐏓𝟑 ༗ آ‌⃖𝄤𝅃"),
    ("𓍼 ໋݊ ", " ⌯ ™| 💗"),
    ("𝄟🦋⃟≛⃝ ", "🦋⃟❤"),
    ("ᯓ𓆰 𝅃꯭꯭꯭꯭꯭❛-", "-֟፝…𓆪᭄ꪾ"),
    ("⛦⃕𝄟•๋๋๋๋๋๋🦋⃟⃟⃟≛⃝💖", "🦋•๋๋๋๋๋๋𝄟⛦⃕"),
    ("𓆩🔥⃝⃪❥༎꯭ࠫ", "꯭༎ࠫ❥⃪⃝🔥𓆪"),
    ("••ᯓ❥๋๋๋๋๋ꗝ༎꯭ࠫ🤍𝆺꯭𝅥", "𝆺꯭𝅥༎ࠫ◡⃝𑲭"),
    ("𐏓𓆩❤🔥𓆪𝆺꯭𝅥༎ࠫ⛧", "⛧༎ࠫ𝆺꯭𝅥𓆩🍷𓆪"),
    ("🎡𓆩᪵🌸⃝۫𝞄⃕𝖋𝖋꯭ᜊ𝆺𝅥⃝", "┼⃖ꭗ🦋¦🌺--🎋"),
    ("𓄂𝆺𝅥⃝🥀⃪⃪꯭ᷟ⃜𖥫꯭꯭꯭𝆺꯭꯭𝅥", "𝆺꯭𝅥🎭🌹꯭"),
    ("◄⏤⃪⃝⃪𐏓🝛꯭𝐈𝛕ᷟ𝚣ꙴ", "⸙ꠋꠋꠋꠋꠋ⛦⃪⃪🝛꯭"),
    ("𓂃⃝💞⃪𓆩🦋⃟≛⃝", "⃝≛⃟🦋𓆪⃪💞⃝𓂃"),
    ("❍─⃜𓆩〭⃛〬🤍𓆪˹", ".⍣⃪ꭗ𝆺𝅥𔘓🪽"),
    ("𓆩🧿⃝🦋⃪⛦⃕", "⛦⃪⃕🦋⃝🧿𓆪"),

    ("◄⏤🔥⃝⃪🐼𓆩꯭❛", "❜꯭𓆪🐼⃪⃝🔥⏤►"),
    ("°ꗝؖ༎꯭ࠫᜊ𝆺꯭𝅥🔥⃝❥༎ࠫ𝆺꯭𝅥", "༎ࠫ٭⃪꯭꯭⃜꯬👅"),
    ("𓆰⃝🔥𝆺꯭꯭꯭𝅥𓆩❥", "❥𓆪꯭꯭꯭𝆺𝅥🔥⃝𓆰"),
    ("◄ᯓ❥≛⃝🌸꯭", "💗⃝꯭꯭❥꯭꯭✿꯭꯭࿐"),
    ("𓆩💀⃝🖤⃪☠", "☠⃪🖤⃝💀𓆪"),
    ("⛧⃝🔥⃪𓆩👑", "👑𓆪⃪🔥⃝⛧"),
    ("𓂀⃝🦋⃪⛦⃕💫", "💫⃕⛦⃪🦋⃝𓂀"),
    ("◄⏤🎭⃝⃪𓆩", "𓆪⃪⃝🎭⏤►"),
    ("𓆩⚡⃝🔥⃪💥", "💥⃪🔥⃝⚡𓆪"),
    ("✦⃝💫⃪𓆩🌌", "🌌𓆪⃪💫⃝✦"),

    ("𓆩🍷⃝✨⃪⛧", "⛧⃪✨⃝🍷𓆪"),
    ("❛⃝🌑⃪𓆩☠", "☠𓆪⃪🌑⃝❜"),
    ("◄ᯓ🖤⃝⃪💀", "💀⃪⃝🖤ᯓ►"),
    ("𓆩🎀⃝💖⃪⛦", "⛦⃪💖⃝🎀𓆪"),
    ("✧⃝🌺⃪𓆩🦋", "🦋𓆪⃪🌺⃝✧"),
    ("𓆩🔥⃝⚔⃪👑", "👑⃪⚔⃝🔥𓆪"),
    ("◄⏤🌪⃝⃪💫", "💫⃪⃝🌪⏤►"),
    ("𓆩🕯⃝🌑⃪☠", "☠⃪🌑⃝🕯𓆪"),
    ("⛦⃕⃝🔥⃪𓆩💎", "💎𓆪⃪🔥⃝⛦⃕"),


]



@app.on_message(filters.command("name"))
async def stylish_name(_, message: Message):
    if len(message.command) < 2:
        return await message.reply_text("**Usage:** `/name hii`")

    text = convert(" ".join(message.command[1:]))

    out = "𓆩 𝐒ᴛʏʟɪꜱʜ 𝐍ᴀᴍᴇ 𓆪:\n\n"
    for pre, suf in STYLES:
        out += f"{pre}{text}{suf}\n\n"

    await message.reply_text(out)

app.run()
